<section id="merit">
   <div class="container">
      <h2>
         Преимущества курса
      </h2>
      <p class="merit__subtitle">
          «Боевое применение береговых ракетно-артиллерийских <br> соединений, воинских частей и подразделений»
{{--         «ИНТЕРАКТИВНАЯ ТОПИЧЕСКАЯ ДИАГНОСТИКА <br>НЕРВНЫХ БОЛЕЗНЕЙ»--}}
      </p>
      <ul class="merit__list row">
         <li class="merit__item col-lg-4 row">
            <div class="merit__elem">
                <svg fill="#9ca324" width="64px" height="64px" viewBox="0 0 64 64" style="fill-rule:evenodd;clip-rule:evenodd;stroke-linejoin:round;stroke-miterlimit:2;" version="1.1" xml:space="preserve" xmlns="http://www.w3.org/2000/svg" xmlns:serif="http://www.serif.com/" xmlns:xlink="http://www.w3.org/1999/xlink"><g id="SVGRepo_bgCarrier" stroke-width="0"></g><g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g><g id="SVGRepo_iconCarrier"> <g transform="matrix(1,0,0,1,-508,-162.338)"> <g id="tank" transform="matrix(1,0,0,1,174.83,162.338)"> <rect height="64" style="fill:none;" width="64" x="333.17" y="0"></rect> <g transform="matrix(1,0,0,1,141.17,-256)"> <path d="M233.236,278L246,278C247.105,278 248,278.895 248,280C248,281.105 247.105,282 246,282C242.408,282 235.236,282 235.236,282L237.236,286L238,286C242.418,286 246,289.582 246,294C246,294 246,294 246,294C246,298.418 242.418,302 238,302C229.584,302 216.416,302 208,302C203.582,302 200,298.418 200,294C200,294 200,294 200,294C200,289.582 203.582,286 208,286C208.195,286 208.306,286 208.306,286C208.306,286 209.477,278.97 210.027,275.671C210.188,274.707 211.022,274 212,274C216.09,274 226.429,274 230,274C230.758,274 231.45,274.428 231.789,275.106C232.381,276.289 233.236,278 233.236,278ZM208,290C205.791,290 204,291.791 204,294C204,294 204,294 204,294C204,296.209 205.791,298 208,298C215.3,298 230.7,298 238,298C240.209,298 242,296.209 242,294C242,294 242,294 242,294C242,291.791 240.209,290 238,290C230.7,290 215.3,290 208,290ZM232.764,286L228.764,278L213.694,278L212.361,286L232.764,286Z"></path> </g> </g> </g> </g></svg>               <p>
                <p>
                  Эффективность
               </p>
               <div>
                  новаторской методики доказана на практике поколениями неврологов, успешно освоивших авторский курс Реутовой В.А.
               </div>
            </div>
         </li>
         <li class="merit__item col-lg-4 row">
            <div class="merit__elem">
                <svg fill="#9ca324" width="64px" height="64px" viewBox="0 0 64 64" style="fill-rule:evenodd;clip-rule:evenodd;stroke-linejoin:round;stroke-miterlimit:2;" version="1.1" xml:space="preserve" xmlns="http://www.w3.org/2000/svg" xmlns:serif="http://www.serif.com/" xmlns:xlink="http://www.w3.org/1999/xlink"><g id="SVGRepo_bgCarrier" stroke-width="0"></g><g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g><g id="SVGRepo_iconCarrier"> <g transform="matrix(1,0,0,1,-430,-81.1692)"> <g id="copter" transform="matrix(1,0,0,1,96.8303,81.1692)"> <rect height="64" style="fill:none;" width="64" x="333.17" y="0"></rect> <g transform="matrix(1,0,0,1,141.17,-128)"> <path d="M248,142C249.104,142 250,142.896 250,144C250,145.104 249.104,146 248,146L232,146L232,150L239.646,150C241.825,150 243.833,151.181 244.891,153.086C246.335,155.685 248.475,159.536 250.447,163.086C251.479,164.945 251.451,167.21 250.373,169.043C249.295,170.875 247.328,172 245.202,172L240,172L240,176L248,176C248.531,176 249.039,176.211 249.414,176.586C249.789,176.961 250,177.47 250,178C250,179.105 249.105,180 248,180C241.698,180 222.302,180 216,180C214.895,180 214,179.105 214,178C214,177.47 214.211,176.961 214.586,176.586C214.961,176.211 215.47,176 216,176C218.918,176 224,176 224,176L224,172L218,172C216.895,172 216,171.105 216,170C216,169 216,168 216,168L200,168C198.895,168 198,167.105 198,166C198,162.586 198,155 198,154C198,153.47 198.211,152.961 198.586,152.586C198.961,152.211 199.47,152 200,152C201.332,152 203.014,152 204,152C204.53,152 205.039,152.211 205.414,152.586C206.525,153.697 208.828,156 208.828,156L216,156L216,154C216,152.939 216.421,151.922 217.172,151.172C217.922,150.421 218.939,150 220,150C223.49,150 228,150 228,150L228,146L212,146C210.896,146 210,145.104 210,144C210,142.896 210.896,142 212,142L248,142ZM236,172L228,172L228,176L236,176L236,172ZM218,164C218.531,164 219.039,164.211 219.414,164.586C219.789,164.961 220,165.47 220,166C220,167 220,168 220,168L245.202,168C245.911,168 246.566,167.625 246.926,167.014C247.285,166.404 247.294,165.648 246.95,165.029C246.112,163.519 245.268,162 245.268,162L234,162C232.895,162 232,161.105 232,160C232,158.895 232.895,158 234,158C237.183,158 243.045,158 243.045,158C243.045,158 242.053,156.214 241.395,155.029C241.042,154.394 240.373,154 239.646,154C235.244,154 220,154 220,154C220,154 220,156.255 220,158C220,159.105 219.105,160 218,160C214.393,160 207.172,160 207.172,160L203.172,156L202,156L202,164L218,164Z"></path> </g> </g> </g> </g></svg>               <p>

                <p>
                  Логичность
               </p>
               <div>
                  изложения позволяет самостоятельно осваивать материал и способствует формированию четкого алгоритма постановки диагноза.
               </div>
            </div>
         </li>
         <li class="merit__item col-lg-4 row">
            <div class="merit__elem">
                <svg fill="#9ca324" width="64px" height="64px" viewBox="0 0 64 64" style="fill-rule:evenodd;clip-rule:evenodd;stroke-linejoin:round;stroke-miterlimit:2;" version="1.1" xml:space="preserve" xmlns="http://www.w3.org/2000/svg" xmlns:serif="http://www.serif.com/" xmlns:xlink="http://www.w3.org/1999/xlink" stroke="#9ca324"><g id="SVGRepo_bgCarrier" stroke-width="0"></g><g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g><g id="SVGRepo_iconCarrier"> <g transform="matrix(1,0,0,1,-508,-81.1692)"> <g id="submarine" transform="matrix(1,0,0,1,174.83,81.1692)"> <rect height="64" style="fill:none;" width="64" x="333.17" y="0"></rect> <g transform="matrix(1,0,0,1,205.17,-192)"> <path d="M160,214L160,211C160,209.674 160.527,208.402 161.464,207.464C162.402,206.527 163.674,206 165,206C166.064,206 167.129,206 168,206C168.53,206 169.039,206.211 169.414,206.586C169.789,206.961 170,207.47 170,208C170,209.105 169.105,210 168,210C166.993,210 165.815,210 165,210C164.735,210 164.48,210.105 164.293,210.293C164.105,210.48 164,210.735 164,211C164,212.185 164,214 164,214L170,214C170.758,214 171.45,214.428 171.789,215.106C172.887,217.301 175.236,222 175.236,222L178,222C183.519,222 188,226.481 188,232C188,237.519 183.519,242 178,242C178,242 153.708,242 150,242C149.69,242 149.383,241.928 149.106,241.789C147.573,241.023 142.395,238.434 142.395,238.434C142.395,238.434 140.426,240.402 139.414,241.414C139.039,241.789 138.53,242 138,242C137.014,242 135.332,242 134,242C133.47,242 132.961,241.789 132.586,241.414C132.211,241.039 132,240.53 132,240C132,236.168 132,227.832 132,224C132,223.47 132.211,222.961 132.586,222.586C132.961,222.211 133.47,222 134,222C135.332,222 137.014,222 138,222C138.53,222 139.039,222.211 139.414,222.586C140.426,223.598 142.395,225.566 142.395,225.566L148.509,222.509C148.509,222.509 151.059,217.409 152.211,215.106C152.55,214.428 153.242,214 154,214C156.067,214 160,214 160,214ZM137.172,226L136,226L136,238L137.172,238C137.172,238 139.277,235.895 140.586,234.586C141.194,233.977 142.124,233.826 142.894,234.211C145.354,235.441 150.472,238 150.472,238L178,238C181.312,238 184,235.311 184,232C184,228.689 181.312,226 178,226L150.472,226C150.472,226 145.354,228.559 142.894,229.789C142.124,230.174 141.194,230.023 140.586,229.414C139.277,228.105 137.172,226 137.172,226ZM168.764,218L155.236,218L153.236,222L170.764,222L168.764,218Z"></path> </g> </g> </g> </g></svg>               <p>
                <p>
                  Принцип «От простого к сложному»
               </p>
               <div>
                  позволяет осваивать каждый последующий раздел на базе уже изученного.
               </div>
            </div>
         </li>
      </ul>
   </div>
</section>
