<section id="about">
   <div class="container">
      <div class="about__block_l row">
         <img style="max-height: 400px; width: 50vw" src="{{ ('images/noname.png') }}" alt="courses" class="img-responsive mx-auto d-block">
         <div class="about__text">
            <span>
               <i class="fa fa-quote-right"></i>
            </span>
            <p>
                Советский и российский государственный деятель, российский военный. Министр обороны Российской Федерации с 6 ноября 2012 года. Генерал армии. Герой Российской Федерации. Заслуженный спасатель Российской Федерации. Кавалер ордена Святого апостола Андрея Первозванного с мечами. Член Высшего совета политической партии «Единая Россия»            </p>
            <a>
               Сергей Соловьев
            </a>
            <p class="about__prg">
                Российский военный деятель
            </p>
         </div>
      </div>
      <div class="about__block_r">
         <div class="about__text">
            <h3>
               Курс «Боевое применение береговых ракетно-артиллерийских соединений, воинских частей и подразделений»
            </h3>
            <p>
{{--             полностью основан на авторской работе врача-невролога Реутовой В.А. Как в бумажном, так и в электронном виде данный курс предназначен для управления самоподготовкой студентов-медиков и врачей-неврологов.--}}
                Данный курс, разработанный Сергеем Соловьевым, предназначен для студентов обучающихся в береговых ракетно-артиллерийских соединений. Он поможет повысить квалификацию специалистов в области управления ракетными комплексами, необходимой для успешного выполнения задач в ракетных войсках
            </p>
{{--            <div class="about__text_small">--}}
{{--                <svg fill="#9ca324" width="64px" height="64px" viewBox="0 0 64 64" style="fill-rule:evenodd;clip-rule:evenodd;stroke-linejoin:round;stroke-miterlimit:2;" version="1.1" xml:space="preserve" xmlns="http://www.w3.org/2000/svg" xmlns:serif="http://www.serif.com/" xmlns:xlink="http://www.w3.org/1999/xlink"><g id="SVGRepo_bgCarrier" stroke-width="0"></g><g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g><g id="SVGRepo_iconCarrier"> <g transform="matrix(1,0,0,1,-508,-162.338)"> <g id="tank" transform="matrix(1,0,0,1,174.83,162.338)"> <rect height="64" style="fill:none;" width="64" x="333.17" y="0"></rect> <g transform="matrix(1,0,0,1,141.17,-256)"> <path d="M233.236,278L246,278C247.105,278 248,278.895 248,280C248,281.105 247.105,282 246,282C242.408,282 235.236,282 235.236,282L237.236,286L238,286C242.418,286 246,289.582 246,294C246,294 246,294 246,294C246,298.418 242.418,302 238,302C229.584,302 216.416,302 208,302C203.582,302 200,298.418 200,294C200,294 200,294 200,294C200,289.582 203.582,286 208,286C208.195,286 208.306,286 208.306,286C208.306,286 209.477,278.97 210.027,275.671C210.188,274.707 211.022,274 212,274C216.09,274 226.429,274 230,274C230.758,274 231.45,274.428 231.789,275.106C232.381,276.289 233.236,278 233.236,278ZM208,290C205.791,290 204,291.791 204,294C204,294 204,294 204,294C204,296.209 205.791,298 208,298C215.3,298 230.7,298 238,298C240.209,298 242,296.209 242,294C242,294 242,294 242,294C242,291.791 240.209,290 238,290C230.7,290 215.3,290 208,290ZM232.764,286L228.764,278L213.694,278L212.361,286L232.764,286Z"></path> </g> </g> </g> </g></svg>--}}

{{--                <p>--}}
{{--                  Цель курса--}}
{{--               </p>--}}
{{--               <div>--}}
{{--                  формирование логического клинического мышления врачей-неврологов.--}}
{{--               </div>--}}
{{--            </div>--}}
         </div>
      </div>
      <!-- <img src="{{ ('images/book0.png') }}" alt="courses" class="img-responsive mx-auto d-block"> -->
   </div>
</section>
