<section id="plan">
   <div id="app" class="container">
      <h2>
         Определенная логическая последовательность курса
      </h2>
      <p class="plan__subtitle">
{{--         позволяет освоить алгоритм клинического мышления врача – невролога: от симптомов к синдромам и, далее, к определению локализации патологического очага, то есть к постановке топического диагноза.--}}
          позволяет освоить алгоритм работы с ракетными комплексами студента – артеллериста: от рассчетов и наводки к выполнению реальных боевых задач.

      </p>
      <div class="plan-curriculum__list row">
         <div class="col-lg-1 col-md-2">
            15
         </div>
         <p class="col-lg-3 col-md-4">
            с этой целью курс разделен на 15<br>узконаправленных разделов
         </p>
         <div class="col-lg-1 col-md-2">
            +
         </div>
         <p class="col-md-4">
         дополнен наглядными схемами, интерактивными<br> рисунками и иллюстрациями с разъяснениями.
         </p>
      </div>
      <div class="plan__block row">
         <div class="col-lg-6 plan__elem_l row">
            <div class="plan__elem">
               <p class="plan__caption">
                  Для студентов
               </p>
               <ul class="plan__list">
                  <li class="plan__item">
                     <img src="{{ ('icons/right.jpg.png') }}" alt="logo">
                     <p>
                        Систематизирует процесс обучения от простого к сложному по каждому разделу обращения с ракетными комплексами.
                     </p>
                  </li>
                  <li class="plan__item">
                     <img src="{{ ('icons/right.jpg.png') }}" alt="logo">
                     <p>
                        Интерактивная форма заданий привычна и понятна студентам, позволяет не отвлекаться на технические вопросы.
                     </p>
                  </li>
                  <li class="plan__item">
                    <img src="{{ ('icons/right.jpg.png') }}" alt="logo">
                     <p>
                        Простые и наглядные схемы способствуют быстрому освоению и запоминанию материала.
                     </p>
                  </li>
                  <li class="plan__item">
                    <img src="{{ ('icons/right.jpg.png') }}" alt="logo">
                     <p>
                        Словарик в каждом разделе курса позволяет быстро усвоить специфическую артеллерийскую терминологию.
                     </p>
                  </li>
                  <li class="plan__item">
                   <img src="{{ ('icons/right.jpg.png') }}" alt="logo">
                     <p>
                        В целом пособие позволяет достаточно просто и быстро освоить метод обращения с ракетными комплексами.
                     </p>
                  </li>
               </ul>
            </div>
         </div>
         <div class="col-lg-6 plan__elem_r row">
            <div class="plan__elem">
               <p class="plan__caption">
                  Для действующих специалистов
               </p>
               <ul class="plan__list">
                  <li class="plan__item">
                   <img src="{{ ('icons/right.jpg.png') }}" alt="logo">
                     <p>
                        Доступная форма изложения и конкретные задачи в каждом из разделов позволяют лучше ориентироваться в сложном процессе работы с обучающими курсами.
                     </p>
                  </li>
                  <li class="plan__item">
                    <img src="{{ ('icons/right.jpg.png') }}" alt="logo">
                     <p>
                        Контрольно-тренировочные карты и задачи – ключевая форма обучения, позволяющая быстро усвоить материал.
                     </p>
                  </li>
                  <li class="plan__item">
                   <img src="{{ ('icons/right.jpg.png') }}" alt="logo">
                     <p>
                        Возможность самоконтроля обеспечивает качество полученных знаний.
                     </p>
                  </li>
                  <li class="plan__item">
                    <img src="{{ ('icons/right.jpg.png') }}" alt="logo">
                     <p>
                        В целом пособие позволяет достаточно просто и быстро освоить метод рассчетов и наводки.
                     </p>
                  </li>
                  <li class="plan__item">
                    <img src="{{ ('icons/right.jpg.png') }}" alt="logo">
                     <p>
                        Новаторская схема позволяет детально изучить алгоритм управления ракетным комплексом. На практике это поможет в борьбе с угразами и защите нашей родины.
                     </p>
                  </li>
               </ul>
            </div>
         </div>
      </div>
   </div>
</section>
