<template>
    <div class="test-block">
        <div style="white-space:nowrap" class="test-number number mr-2">
            {{ ordinalNumber }} <b>/   {{ questions }}</b>
        </div>
        <div class="test-main test-course-of-the-first-neurons">
            <div class="test-caption">
                <p>
                    Иннервация мышц глазного яблока глазодвигательными нервами
                    <span>
                    Вписать в схему ядра III и VI пар черепных нервов и их
                    надъядерные пути.
                </span>
                </p>
                <div class="test-number number" style="width: 100%;">
                    <b>Карточка книги <span style="font-weight: 700; display: inline;">№{{ number }}</span></b>
                </div>
            </div>
            <div id="stage-parent67" class="test-compliance test-compliance__img">
                <div
                    v-if="!completed"
                    id="question_67"
                    class="compliance-img"
                ></div>
                <div v-if="completed" id="question_67">
                    <div style="display: flex; justify-content: center;">
                        <img
                            :src="currentUrl + '/test-img/answer67.png'"
                            alt="courses"
                            v-bind:class="{
                                correct: correct == 1,
                                incorrect: correct == 0
                            }"
                        />
                    </div>
                </div>
            </div>
            <div class="swipe-block">
                <div class="row">
                    <div class="col-sm-2 col-3">
                        <img
                            :src="currentUrl + '/test-img/arm1.png'"
                            alt="courses"
                        />
                        <img
                            :src="currentUrl + '/test-img/arm2.png'"
                            alt="courses"
                        />
                    </div>
                    <div class="col-sm-10 col-9">
                        <p>
                            Перемешайте картинку вверх-вниз, влево-впарво и
                            увеличивайтечто бы увидеть ее целиком
                        </p>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>

<script>
var stage67 = null;
export default {
    props: {
        number: {
            type: String,
            default: "01"
        },
        from: {
            type: String,
            default: "01"
        },
        completed: {
            type: Boolean
        },
        serverAnswers: {
            type: Array
        },
      questions: {
            type: Number,
        },
        ordinalNumber: {
            type: String,
            default: "01"
        },
    },
    created() {
        this.currentUrl = window.location.origin;
        window.addEventListener("resize", this.fitStageIntoParentContainer);
    },
    data() {
        return {
            body67: [
                {
                    id: 16,
                    data:
                        "M 28.25,24.78 C 28.03,24.93 22.55,29.30 22.06,29.78 23.60,30.23 26.77,31.03 27.41,31.29 27.76,30.92 28.28,30.26 28.91,29.69 28.79,28.68 28.47,24.63 28.25,24.78 Z"
                },
                {
                    id: 14,
                    data:
                        "M 73.28,73.05 C 74.45,73.03 75.55,73.84 75.62,75.27 75.70,76.69 74.03,77.31 73.17,77.25 72.09,77.22 71.00,76.39 70.98,75.09 70.97,73.80 72.25,73.02 73.28,73.05 Z"
                },
                {
                    id: 15,
                    data:
                        "M 110.38,39.08 C 110.28,39.14 109.08,40.02 108.67,40.16 108.27,40.29 106.53,38.56 106.14,38.75 105.74,38.94 104.01,39.84 103.89,40.11 103.77,40.38 103.76,42.50 103.67,42.61 103.58,42.72 102.59,43.38 101.56,44.02 100.86,43.77 99.70,42.25 99.20,42.41 98.92,42.65 97.07,43.64 96.92,43.95 96.77,44.27 97.23,46.18 97.02,46.45 96.80,46.73 95.07,47.60 94.70,47.81 94.34,48.03 92.55,46.60 92.33,46.77 92.10,46.93 90.09,47.82 90.00,48.20 89.90,48.59 90.39,50.74 90.23,50.98 90.08,51.23 88.84,52.12 88.50,52.31 88.16,52.50 86.27,51.57 86.06,51.78 85.86,51.99 83.95,53.19 83.92,53.59 83.89,54.00 84.94,55.89 84.78,56.12 84.62,56.36 83.19,57.57 82.89,57.95 82.59,58.34 80.54,57.37 80.38,57.50 80.20,57.63 78.69,59.21 78.64,59.61 78.60,60.01 80.01,61.86 79.95,62.05 79.90,62.23 78.76,64.02 78.50,64.31 78.24,64.60 76.11,64.51 75.88,64.66 75.80,65.03 75.39,65.89 75.02,67.53 75.00,67.85 77.28,68.95 77.20,69.16 77.13,69.36 76.75,70.94 76.75,71.06 76.60,71.03 78.58,73.54 78.39,73.66 78.20,73.77 77.02,74.53 76.88,74.64 76.73,74.75 75.45,72.19 75.34,72.20 75.23,72.21 72.45,73.06 72.28,72.97 72.11,72.88 71.43,71.64 71.59,71.53 71.76,71.43 74.93,70.52 74.72,70.45 74.73,70.31 74.83,69.22 74.94,68.92 75.04,68.62 77.19,68.21 77.31,67.94 77.44,67.66 78.14,65.67 78.12,65.42 78.11,65.17 76.31,63.63 76.44,63.36 76.56,63.09 77.60,60.95 77.91,60.80 78.21,60.65 80.40,61.35 80.55,61.16 80.70,60.97 82.27,59.46 82.28,59.14 82.29,58.82 80.75,57.01 80.95,56.69 81.16,56.36 82.74,54.61 82.98,54.50 83.23,54.39 85.41,55.30 85.64,55.16 85.87,55.02 87.51,53.55 87.50,53.28 87.49,53.01 86.67,51.09 86.86,50.91 87.05,50.73 88.55,48.98 88.91,48.97 89.26,48.96 91.17,50.20 91.45,50.20 91.74,50.20 93.45,48.97 93.66,48.61 93.86,48.26 92.74,46.18 93.11,45.95 93.48,45.73 95.01,44.62 95.33,44.59 95.65,44.56 97.71,45.95 97.88,45.81 98.05,45.67 100.13,44.61 100.34,44.42 100.56,44.24 100.25,41.99 100.45,41.86 100.66,41.73 102.15,40.76 102.50,40.75 102.84,40.74 105.02,42.07 105.16,42.09 105.30,42.12 106.95,41.03 107.17,40.81 107.40,40.60 107.18,38.33 107.38,38.17 107.57,38.01 109.46,37.39 109.54,37.54 109.62,37.69 110.47,39.02 110.38,39.08 Z"
                },
                {
                    id: 3,
                    data:
                        "M 76.44,81.83 C 76.44,81.83 77.28,77.69 77.28,77.69 77.28,77.69 77.99,77.69 77.99,77.69 77.99,77.69 77.34,81.83 77.34,81.83 77.34,81.83 76.44,81.83 76.44,81.83 76.44,81.83 75.24,81.83 75.24,81.83 75.24,81.83 75.87,77.63 75.87,77.63 75.87,77.63 76.77,77.60 76.77,77.60 76.77,77.60 75.84,81.83 75.84,81.83 75.84,81.83 73.70,81.83 73.70,81.83 73.70,81.83 74.37,77.65 74.37,77.65 74.37,77.65 75.22,77.65 75.22,77.65 75.22,77.65 74.33,81.83 74.33,81.83 74.33,81.83 76.44,81.83 76.44,81.83 Z"
                },
                {
                    id: 16,
                    data:
                        "M 116.36,46.60 C 116.55,47.60 117.26,53.10 117.29,53.18 117.32,53.26 111.49,50.80 111.49,50.80 111.49,50.80 115.37,47.28 116.36,46.60 Z"
                },
                {
                    id: 14,
                    data:
                        "M 75.50,96.14 C 76.25,96.14 77.26,96.82 77.18,97.87 77.11,98.92 76.40,99.70 75.54,99.70 74.67,99.70 73.55,99.14 73.59,97.75 73.81,96.78 74.19,95.99 75.50,96.14 Z"
                },
                {
                    id: 5,
                    data:
                        "M 80.60,101.61 C 80.58,101.57 80.07,97.40 80.07,97.40 80.07,97.40 80.95,97.40 80.95,97.40 80.95,97.40 81.27,100.36 81.27,100.36 81.27,100.36 82.84,97.42 82.84,97.42 82.84,97.42 83.61,97.42 83.61,97.42 83.61,97.42 81.46,101.61 81.46,101.61 81.46,101.61 83.05,101.61 83.05,101.61 83.05,101.61 83.96,97.44 83.96,97.44 83.96,97.44 84.64,97.44 84.64,97.44 84.64,97.44 83.74,101.61 83.74,101.61 83.74,101.61 80.66,101.61 80.60,101.61 Z"
                },
                {
                    id: 16,
                    data:
                        "M 24.31,41.88 C 24.31,41.88 19.19,36.12 19.19,36.12 19.19,36.12 16.75,44.00 16.75,44.00 16.75,44.00 24.31,41.88 24.31,41.88 Z"
                },
                {
                    id: 15,
                    data:
                        "M 72.93,79.60 C 73.01,79.45 72.90,77.45 72.71,77.47 72.53,77.48 70.13,76.57 70.13,76.53 70.13,76.50 70.77,73.31 70.73,73.31 70.70,73.31 68.95,72.76 68.80,72.76 68.65,73.21 67.96,76.22 67.82,75.98 67.68,75.73 66.49,75.87 65.47,75.82 65.19,75.99 63.74,76.71 63.11,76.60 62.48,76.49 61.29,74.94 61.07,74.53 60.85,74.13 62.56,72.39 62.42,71.73 62.29,71.08 61.46,70.03 61.24,69.73 61.03,69.43 58.41,70.41 57.97,70.00 57.53,69.59 56.75,68.12 56.53,67.88 56.31,67.63 58.34,66.00 58.28,65.53 58.23,65.07 56.61,63.51 56.31,63.12 56.01,62.74 54.12,64.10 53.47,63.69 52.81,63.28 52.27,62.12 51.78,61.41 51.29,60.70 53.61,59.28 53.28,58.88 52.95,58.46 52.05,56.84 51.72,56.56 51.39,56.29 49.11,57.79 48.56,57.16 48.02,56.53 47.18,55.38 46.94,54.94 46.69,54.50 48.54,53.04 48.41,52.62 48.27,52.22 47.31,50.72 46.84,50.56 46.38,50.40 44.22,51.44 43.78,50.78 43.35,50.13 42.52,49.06 42.28,48.59 42.04,48.13 43.62,47.09 43.56,46.44 43.51,45.78 42.30,44.26 42.00,43.94 41.70,43.61 39.15,45.08 38.91,44.56 38.66,44.04 37.43,42.74 37.19,42.25 36.94,41.76 38.46,40.34 38.38,39.91 38.29,39.47 37.15,38.33 36.72,37.81 36.28,37.29 34.75,38.60 34.06,38.00 33.38,37.40 32.19,36.14 32.19,35.81 32.19,35.49 33.37,34.49 33.31,34.00 33.26,33.51 31.59,31.94 31.31,31.78 31.04,31.62 29.58,32.66 29.06,32.47 28.55,32.28 27.50,31.39 27.41,31.31 27.44,31.23 28.89,29.69 28.92,29.67 29.22,29.91 30.08,30.64 30.38,31.09 30.67,31.54 29.50,32.69 29.50,33.22 29.50,33.74 31.29,34.80 31.59,35.06 31.89,35.32 34.01,34.75 34.34,35.12 34.68,35.50 36.08,36.70 36.16,37.00 36.23,37.30 34.96,38.82 35.03,39.16 35.11,39.49 36.42,41.08 36.69,41.34 36.95,41.61 38.70,40.59 39.19,40.97 39.67,41.34 40.67,42.84 40.97,43.22 41.27,43.59 39.55,45.23 39.81,45.72 40.08,46.20 41.52,47.65 41.78,47.88 42.05,48.10 44.21,46.84 44.66,47.22 45.11,47.59 46.07,49.02 46.22,49.44 46.37,49.85 44.53,51.28 44.56,51.84 44.60,52.40 45.99,54.07 46.34,54.31 46.70,54.56 48.57,53.25 49.19,53.53 49.80,53.81 50.59,55.40 50.81,55.72 51.04,56.04 49.78,57.41 49.47,57.97 49.47,58.40 50.85,60.09 51.09,60.38 51.34,60.66 53.69,59.74 54.16,60.12 54.62,60.51 55.16,61.93 55.41,62.28 55.65,62.63 53.83,64.12 53.97,64.50 54.11,64.88 55.51,66.59 55.81,66.97 56.11,67.35 58.44,66.09 59.12,66.47 59.81,66.85 60.24,68.30 60.41,68.66 60.57,69.01 58.79,70.73 58.87,71.13 58.95,71.54 59.98,72.87 60.20,73.11 60.42,73.36 62.99,72.75 63.40,72.91 63.81,73.08 64.62,74.48 64.89,74.76 65.16,75.03 64.69,77.56 64.93,77.89 65.76,78.00 68.68,77.98 68.71,77.98 69.78,78.51 72.86,79.75 72.93,79.60 Z"
                },
                {
                    id: 15,
                    data:
                        "M 71.49,101.22 C 71.49,101.22 70.11,101.57 70.02,101.49 69.93,101.41 69.10,99.08 68.89,99.07 68.68,99.05 66.45,98.80 66.33,99.02 66.22,99.24 64.39,101.23 64.09,101.18 63.79,101.12 62.01,100.08 61.89,99.67 61.77,99.25 63.04,97.82 63.13,97.47 63.22,97.12 63.04,95.50 63.00,95.11 62.96,94.72 60.14,94.21 60.09,93.82 60.04,93.43 59.99,91.58 60.04,91.13 60.10,90.69 62.44,89.98 62.40,89.58 62.36,89.17 62.60,87.62 62.31,87.04 61.60,86.82 60.24,86.09 59.71,86.04 59.38,85.67 59.10,83.88 59.18,83.49 59.26,83.10 61.29,81.70 61.27,81.49 61.24,81.28 60.32,79.23 60.09,79.07 59.86,78.91 57.52,79.07 57.38,78.87 57.23,78.66 56.22,77.07 56.22,76.69 56.22,76.31 57.57,74.45 57.49,74.09 57.41,73.72 56.16,72.19 56.00,72.09 55.84,71.98 53.72,72.46 53.51,72.29 53.30,72.12 51.87,70.42 51.84,69.93 51.82,69.45 53.20,68.09 53.20,67.82 53.20,67.55 52.30,66.21 52.02,65.98 51.75,65.74 49.08,66.05 48.98,65.84 48.87,65.64 47.51,64.17 47.44,63.78 47.38,63.39 48.60,61.26 48.36,60.93 48.11,60.61 47.18,59.43 46.82,59.29 46.46,59.15 44.33,60.05 44.11,59.87 43.89,59.68 42.39,58.20 42.31,57.89 42.23,57.57 43.49,55.42 43.40,55.16 43.31,54.89 41.92,53.63 41.67,53.47 41.42,53.30 38.93,54.23 38.69,54.18 38.46,54.12 36.72,52.61 36.60,52.31 36.48,52.01 37.73,49.65 37.53,49.47 37.34,49.29 35.97,47.84 35.71,47.80 35.45,47.76 33.06,49.04 32.82,48.82 32.59,48.60 31.02,47.28 30.98,47.04 30.94,46.81 31.58,45.13 31.36,44.84 31.13,44.56 29.50,43.36 29.40,43.36 29.30,43.36 26.48,44.57 26.24,44.53 26.01,44.49 23.93,43.29 23.89,43.02 23.85,42.75 25.31,41.01 25.58,41.18 25.85,41.35 27.71,42.13 27.87,42.53 28.03,42.94 27.40,44.89 27.53,45.02 27.66,45.15 29.48,46.44 29.78,46.56 30.08,46.67 32.30,45.14 32.51,45.44 32.72,45.74 34.43,46.90 34.44,47.11 34.46,47.32 33.65,49.25 33.82,49.53 33.99,49.82 35.29,51.11 35.56,51.33 35.82,51.56 38.37,50.23 38.60,50.40 38.83,50.57 40.44,51.91 40.56,52.20 40.67,52.49 39.63,54.82 39.73,55.02 39.84,55.23 41.06,56.66 41.42,56.82 41.78,56.98 43.85,55.97 44.20,56.24 44.55,56.52 46.04,57.87 46.00,58.29 45.96,58.71 44.62,60.48 44.84,60.62 44.92,60.87 46.12,62.42 46.49,62.73 46.85,63.05 49.09,62.06 49.31,62.29 49.53,62.52 50.81,64.15 50.91,64.49 51.02,64.83 49.52,66.82 49.60,67.02 49.68,67.23 50.72,68.53 51.09,69.00 51.45,69.47 53.70,68.55 53.91,68.87 54.12,69.18 55.53,70.72 55.58,71.04 55.63,71.37 53.81,73.02 53.98,73.33 54.15,73.65 55.27,75.42 55.62,75.60 55.97,75.78 58.16,75.37 58.31,75.69 58.47,76.02 59.33,77.72 59.36,77.96 59.38,78.19 57.83,79.82 57.89,80.04 57.94,80.27 58.69,82.09 58.91,82.38 59.13,82.66 61.63,82.62 61.73,82.91 61.84,83.20 61.99,85.34 61.96,85.69 61.92,86.04 59.77,86.87 59.82,87.13 59.87,87.39 59.83,89.64 60.02,89.87 60.22,90.09 62.88,90.68 62.87,91.09 62.85,91.49 63.04,93.33 62.98,93.82 62.91,94.32 59.98,94.93 60.02,95.02 60.02,95.23 60.07,97.81 60.69,98.00 61.03,98.31 63.68,97.83 63.78,97.96 63.88,98.08 65.55,98.92 65.56,98.98 65.56,99.03 66.08,101.64 66.16,101.64 66.22,101.65 68.63,101.65 68.80,101.60 68.97,101.55 69.73,99.02 69.77,99.02 69.80,99.02 70.98,98.88 70.94,98.80 70.91,98.72 70.85,96.46 70.88,96.08 71.23,96.08 72.72,96.06 73.08,96.11 73.13,96.65 72.95,99.20 72.98,99.42 73.00,99.64 75.51,100.54 75.89,100.84 75.86,101.42 74.89,102.19 74.89,102.60 74.35,102.57 71.49,101.22 71.49,101.22 Z"
                },
                {
                    id: 15,
                    data:
                        "M 73.24,94.44 C 73.43,94.68 73.95,95.66 74.09,95.80 74.35,95.76 76.68,94.84 76.87,95.07 77.05,95.29 78.44,97.35 78.62,97.20 78.81,97.05 80.08,96.18 80.27,95.96 80.08,95.70 78.38,93.58 78.38,93.58 78.38,93.58 78.42,92.49 78.42,92.49 78.42,92.49 76.45,91.21 76.29,90.93 76.13,90.66 76.31,89.35 76.31,88.91 76.31,88.47 78.96,87.97 79.04,87.56 79.13,87.15 79.52,85.50 79.49,85.33 79.46,85.17 77.56,83.57 77.56,83.24 77.56,82.91 78.17,81.03 78.20,80.73 78.23,80.43 80.82,80.58 81.07,79.98 81.31,79.38 81.63,77.74 81.84,77.47 81.31,77.20 80.29,76.09 79.69,75.51 80.11,74.91 80.69,73.36 81.07,73.09 81.07,72.84 83.74,73.21 83.93,72.69 84.13,72.17 84.92,71.06 85.00,70.73 85.08,70.41 83.82,68.87 83.38,68.29 83.73,67.64 84.52,66.22 84.71,65.87 84.90,65.51 87.36,66.47 87.71,66.09 88.07,65.71 88.98,65.00 89.22,64.64 89.47,64.29 87.93,62.22 87.93,61.76 87.93,61.29 89.20,60.16 89.58,59.78 89.96,59.40 92.04,60.63 92.44,60.33 92.86,60.03 94.02,59.13 94.27,58.89 94.51,58.64 93.72,56.91 93.80,56.44 93.88,55.98 95.47,55.09 95.93,54.71 96.39,54.33 97.77,56.20 98.53,55.93 99.29,55.66 100.92,54.93 101.11,54.71 101.30,54.49 100.82,52.62 100.96,52.27 101.09,51.91 103.12,51.14 103.44,51.00 103.77,50.87 104.99,52.76 105.56,52.76 106.13,52.76 107.74,52.21 108.07,52.04 108.39,51.88 108.54,50.12 108.84,49.73 109.14,49.35 111.40,49.47 111.40,49.47 111.40,49.47 111.44,51.57 111.47,51.76 111.49,51.95 109.25,51.78 109.11,51.89 108.97,52.00 107.35,49.87 107.13,49.87 106.91,49.87 105.15,50.29 104.93,50.53 104.71,50.78 104.75,52.87 104.67,53.11 104.59,53.35 102.31,54.21 101.93,54.16 101.55,54.10 99.91,52.60 99.53,52.69 99.15,52.77 97.45,53.71 97.18,53.98 96.91,54.25 97.46,56.03 97.24,56.36 97.03,56.69 95.55,58.00 95.20,58.09 94.84,58.17 93.35,56.64 92.91,56.78 92.48,56.92 90.73,58.47 90.60,58.80 90.46,59.13 91.52,60.89 91.36,61.49 91.19,62.09 90.18,63.06 89.91,63.11 89.64,63.17 87.46,62.51 87.24,62.76 87.03,63.00 85.99,64.08 85.67,64.49 85.34,64.90 87.00,66.74 86.89,67.31 86.78,67.88 85.72,69.14 85.42,69.60 84.80,69.67 83.53,69.40 82.87,69.42 82.58,69.80 81.74,71.38 81.56,71.73 81.36,72.09 83.51,74.04 83.40,74.53 83.29,75.02 82.55,76.07 82.36,76.42 81.68,76.62 80.04,76.82 79.44,77.00 78.95,77.60 78.85,78.99 78.69,79.42 78.53,79.86 80.78,80.87 80.64,81.47 80.51,82.07 80.18,83.55 79.93,83.96 79.69,84.36 77.35,84.65 77.13,85.09 76.91,85.53 76.88,86.90 76.82,87.33 76.77,87.77 79.06,88.22 79.11,88.69 79.17,89.15 79.10,90.66 78.93,91.18 77.73,91.56 76.38,92.09 76.36,92.09 76.33,92.09 76.18,93.06 76.18,93.09 76.18,93.12 73.02,94.22 73.24,94.44 Z"
                },
                {
                    id: 16,
                    data:
                        "M 113.84,33.55 C 113.88,34.00 115.56,39.66 115.58,40.02 115.60,40.37 110.08,38.08 110.09,38.27 110.11,38.45 113.39,33.49 113.84,33.55 Z"
                }
            ],
            complited67: false,
            icons: [
                {
                    icon: "test-img/3.png",
                    id: 3
                },
                {
                    icon: "test-img/icon5.png",
                    id: 5
                },
                {
                    icon: "test-img/icon13.png",
                    id: 13
                },
                {
                    icon: "test-img/icon14.png",
                    id: 14
                },
                {
                    icon: "test-img/icon15.png",
                    id: 15
                },
                {
                    icon: "test-img/icon16.png",
                    id: 16
                }
            ],
            draggetItem: null,
            question_67Width: 645,
            question_67Height: 354
        };
    },

    watch: {
        complited67: {
            handler: function(newVal, oldVal) {
                this.$emit("answer", {
                    question_index: 67,
                    answer: [{ result: this.complited67 }]
                });
            },
            deep: true
        }
    },
    mounted() {
        if (!this.completed)
        {
            setTimeout(() => {
                this.onStart();
                let swiper = document.querySelector(".test-swiper").swiper
                swiper.update()
            }, 2000)
        }
    },
    methods: {
        fitStageIntoParentContainer() {
            var container = document.querySelector("#stage-parent67");

            // now we need to fit stage into parent
            var containerWidth = container.offsetWidth;
            // to do this we need to scale the stage
            var scale = containerWidth / this.question_67Width;
            //var scale = 0.94;

            stage67.width(this.question_67Width * scale);
            stage67.height(this.question_67Height * scale);
            stage67.scale({
                x: scale,
                y: scale
            });
            stage67.draw();
        },

        onStart() {
            let self = this;
            stage67 = new Konva.Stage({
                container: "question_67",
                width: this.question_67Width,
                height: this.question_67Height
            });

            var templayer67 = new Konva.Layer();
            var layer67 = new Konva.Layer();
            var group67 = new Konva.Group();
            var counter67 = 0;
            stage67.add(layer67);
            stage67.add(templayer67);
            var path67Front;
            var test67;
            Konva.Image.fromURL(
                `${this.currentUrl}/test-img/test77.png`,
                function(test67) {
                    test67.setAttrs({
                        x: 0,
                        y: 0,
                        scaleX: 1,
                        scaleY: 1,
                        name: "test77 first brain"
                    });
                    templayer67.add(test67);
                    templayer67.batchDraw();
                }
            );

            for (var i = 0; i < this.body67.length; i++) {
                path67Front = new Konva.Path({
                    x: -40,
                    y: -20,
                    fill: "#f5f5f5",
                    data: this.body67[i].data,
                    numPoints: 10,
                    innerRadius: 20,
                    outerRadius: 25,
                    scaleX: 3,
                    scaleY: 3,
                    id: this.body67[i].id
                });
                layer67.add(path67Front);
            }

            var borderOfRect67;
            var romanIII = new Image();
            var romanVI = new Image();
            var dot67 = new Image();
            var dottedLine67 = new Image();
            var arrowRight67 = new Image();
            var chevroneRight67 = new Image();
            var line67 = new Image();

            borderOfRect67 = new Konva.Rect({
                cornerRadius: 5,
                x: 375,
                y: 5,
                width: 118,
                height: 54,
                fill: "#f5f5f5",
                stroke: "#e6e6e6",
                strokeWidth: 1
            });
            group67.add(borderOfRect67);

            borderOfRect67 = new Konva.Rect({
                cornerRadius: 5,
                x: 508,
                y: 5,
                width: 118,
                height: 54,
                fill: "#f5f5f5",
                stroke: "#e6e6e6",
                strokeWidth: 1
            });
            group67.add(borderOfRect67);

            borderOfRect67 = new Konva.Rect({
                cornerRadius: 5,
                x: 375,
                y: 74,
                width: 118,
                height: 54,
                fill: "#f5f5f5",
                stroke: "#e6e6e6",
                strokeWidth: 1
            });
            group67.add(borderOfRect67);

            borderOfRect67 = new Konva.Rect({
                cornerRadius: 5,
                x: 508,
                y: 74,
                width: 118,
                height: 54,
                fill: "#f5f5f5",
                stroke: "#e6e6e6",
                strokeWidth: 1
            });
            group67.add(borderOfRect67);

            borderOfRect67 = new Konva.Rect({
                cornerRadius: 5,
                x: 375,
                y: 143,
                width: 118,
                height: 54,
                fill: "#f5f5f5",
                stroke: "#e6e6e6",
                strokeWidth: 1
            });
            group67.add(borderOfRect67);

            Konva.Image.fromURL(`${this.currentUrl}/test-img/3.png`, function(
                romanIII
            ) {
                romanIII.setAttrs({
                    x: 431,
                    y: 27,
                    scaleX: 1,
                    scaleY: 1,
                    draggable: true,
                    name: "Image dot",
                    id: 3
                });
                templayer67.add(romanIII);
                templayer67.batchDraw();
            });

            Konva.Image.fromURL(
                `${this.currentUrl}/test-img/icon5.png`,
                function(romanVI) {
                    romanVI.setAttrs({
                        x: 555,
                        y: 25,
                        scaleX: 1,
                        scaleY: 1,
                        draggable: true,
                        name: "Image dot",
                        id: 5
                    });
                    templayer67.add(romanVI);
                    templayer67.batchDraw();
                }
            );

            Konva.Image.fromURL(
                `${this.currentUrl}/test-img/icon14.png`,
                function(dot67) {
                    dot67.setAttrs({
                        x: 427,
                        y: 95,
                        scaleX: 1.2,
                        scaleY: 1.2,
                        draggable: true,
                        name: "Image dot",
                        id: 14
                    });
                    templayer67.add(dot67);
                    templayer67.batchDraw();
                }
            );

            Konva.Image.fromURL(
                `${this.currentUrl}/test-img/icon15.png`,
                function(dottedLine67) {
                    dottedLine67.setAttrs({
                        x: 550,
                        y: 100,
                        scaleX: 2,
                        scaleY: 5,
                        draggable: true,
                        name: "Image dotted line",
                        id: 15
                    });
                    templayer67.add(dottedLine67);
                    templayer67.batchDraw();
                }
            );
            Konva.Image.fromURL(
                `${this.currentUrl}/test-img/icon16.png`,
                function(arrowRight67) {
                    arrowRight67.setAttrs({
                        x: 427,
                        y: 163,
                        scaleX: 1.2,
                        scaleY: 1.2,
                        draggable: true,
                        name: "Image arrow right",
                        id: 16
                    });
                    templayer67.add(arrowRight67);
                    templayer67.batchDraw();
                }
            );

            borderOfRect67 = new Konva.Rect({
                cornerRadius: 5,
                x: 507,
                y: 143,
                width: 120,
                height: 54,
                fill: "#f5f5f5",
                stroke: "#e6e6e6",
                strokeWidth: 1
            });
            group67.add(borderOfRect67);
            var text67;
            text67 = new Konva.Text({
                x: 542,
                y: 165,
                draggable: false,
                fill: "black",
                text: "Очистить"
            });
            group67.add(text67);

            templayer67.add(group67);
            templayer67.draw();
            var targetPositionX;
            var targetPositionY;
            stage67.on("dragstart", function(e) {
                e.target.moveTo(templayer67);
                targetPositionX = e.target.attrs.x;
                targetPositionY = e.target.attrs.y;
                self.draggetItem = e.target.attrs.id;
                //console.log(targetPositionX)
                //console.log('Moving ' + e.target.name());
                layer67.draw();
            });

            var previousShape;
            stage67.on("dragmove", function(evt) {
                var pos = stage67.getPointerPosition();
                var shape = layer67.getIntersection(pos);
                if (previousShape && shape) {
                    if (previousShape !== shape) {
                        // leave from old targer
                        previousShape.fire(
                            "dragleave",
                            {
                                type: "dragleave",
                                target: previousShape,
                                evt: evt.evt
                            },
                            true
                        );

                        // enter new targer
                        shape.fire(
                            "dragenter",
                            {
                                type: "dragenter",
                                target: shape,
                                evt: evt.evt
                            },
                            true
                        );
                        previousShape = shape;
                    } else {
                        previousShape.fire(
                            "dragover",
                            {
                                type: "dragover",
                                target: previousShape,
                                evt: evt.evt
                            },
                            true
                        );
                    }
                } else if (!previousShape && shape) {
                    previousShape = shape;
                    shape.fire(
                        "dragenter",
                        {
                            type: "dragenter",
                            target: shape,
                            evt: evt.evt
                        },
                        true
                    );
                } else if (previousShape && !shape) {
                    previousShape.fire(
                        "dragleave",
                        {
                            type: "dragleave",
                            target: previousShape,
                            evt: evt.evt
                        },
                        true
                    );
                    previousShape = undefined;
                }
            });
            stage67.on("dragend", function(e) {
                var pos = stage67.getPointerPosition();
                var shape = layer67.getIntersection(pos);
                if (shape) {
                    previousShape.fire(
                        "drop",
                        {
                            type: "drop",
                            target: previousShape,
                            evt: e.evt
                        },
                        true
                    );
                }
                if (previousShape != undefined) {
                    e.target.setAttrs({
                        x: targetPositionX,
                        y: targetPositionY
                    });
                }
                console.log(counter67);
                if (counter67 === 12) {
                    self.complited67 = true;
                    //console.log(self.complited67);
                }
                previousShape = undefined;
                layer67.draw();
                templayer67.draw();
            });

            stage67.on("dragenter", function(e) {
                e.target.fill("red");
                layer67.draw();
            });

            stage67.on("dragleave", function(e) {
                e.target.fill("#f5f5f5");
                layer67.draw();
            });

            stage67.on("dragover", function(e) {
                layer67.draw();
            });

            stage67.on("drop", function(e) {
                if (e.target.attrs.id === self.draggetItem) {
                    e.target.fill("black");
                    e.target.moveTo(templayer67);
                    counter67++;
                } else {
                    e.target.fill("#f5f5f5");
                }
                layer67.draw();
            });
            this.fitStageIntoParentContainer();
            text67.on("click", this.onStart);
            text67.on("tap", this.onStart);
        }
    },
    computed: {
        currentQuestionAnswers() {
            if (!this.serverAnswers) {
                return null;
            }

            return this.serverAnswers.find(x => x.question_index == "67");
        },
        correct() {
            if (!this.serverAnswers) {
                return null;
            }

            try {
                if (this.currentQuestionAnswers.answer[0].result) {
                    return 1;
                } else {
                    return 0;
                }
            } catch (error) {
                return 0;
            }
        }
    }
};
</script>

<style>
.drag,
.drop {
    display: inline-block;
}

.drop.allowed {
    background-color: #dfd;
}
</style>
